; Finnish v1.0
; Toni Ahola

[Finnish]
IDS_TITLE_EXCLUDE=Exclude
IDS_FILE=Tiedosto
IDS_SETTINGS=Asetukset
IDS_EXIT=Sulje
IDS_EDIT=Muokkaa
IDS_PURGE_UNUSED=Purge unused apps
IDS_PURGE_TIMERS=Purge timers
IDS_FIND=Search
IDS_REFRESH=Päivitä
IDS_VIEW=Näkymä
IDS_ICONS=Ikonit
IDS_ICONSSMALL=Pieni
IDS_ICONSLARGE=Iso
IDS_ICONSISHIDDEN=Piiloita ikonit
IDS_LANGUAGE=Kieli
IDS_FONT=Font
IDS_HELP=Apua
IDS_WEBSITE=Kotisivut
IDS_CHECKUPDATES=Tarkista päivitykset
IDS_DONATE=Give thanks!
IDS_ABOUT=Tietoja
IDS_TRAY_SHOW=Näytä/Piiloita
IDS_TRAY_START=Enable filters
IDS_TRAY_STOP=Disable filters
IDS_TRAY_RULES=Rules
IDS_TRAY_BLOCKLIST_RULES=Estolista
IDS_TRAY_SYSTEM_RULES=Järjestelmän säännöt
IDS_TRAY_USER_RULES=Custom rules
IDS_TRAY_LOGERR=Errors log
IDS_ADD_FILE=Lisää tiedosto
IDS_ANY=Kaikki
IDS_DISABLENOTIFICATIONS=Estä ilmoitukset
IDS_OPENRULESEDITOR=Luo sääntö
IDS_TIMER=Timer
IDS_DISABLETIMER=Disable timer
IDS_EXPLORE=Avaa sisältävä kansio
IDS_COPY=Kopioi
IDS_SELECT_ALL=Select all
IDS_CHECK=Ruksaa valitut
IDS_UNCHECK=Poista ruksi valituista
IDS_ADD=Lisää
IDS_EDIT2=Muokkaa
IDS_DELETE=Poista
IDS_EXPORT=Vie
IDS_IMPORT=Tuo
IDS_RULE_ALLOWLOOPBACK=Allow loopback connections for all
IDS_HIGHLIGHT_INVALID=Tiedostoa ei löydy
IDS_HIGHLIGHT_NETWORK=Jaettu verkkotiedosto
IDS_HIGHLIGHT_PICO=Pico ohjelma
IDS_HIGHLIGHT_SIGNED=Signed app
IDS_HIGHLIGHT_SILENT=Estetyt ilmoitukset
IDS_HIGHLIGHT_SPECIAL=Special rules
IDS_HIGHLIGHT_SYSTEM=Järjestelmätiedosto
IDS_GROUP_TIMER=Timer app
IDS_EDITOR=Sääntöjen muokkaus
IDS_NAME=Nimi
IDS_RULE=Sääntö
IDS_PORTVERSION=Family (ports only)
IDS_PROTOCOL=Protokolla
IDS_DIRECTION=Suunta
IDS_ACTION=Toiminto
IDS_DATE=Päiväys
IDS_FILEPATH=Path
IDS_SIGNATURE=Signature
IDS_ADDRESS=Osoite
IDS_FILTER=Suodatin
IDS_NOTES=Muistiinpanot
IDS_ADDED=Lisätty
IDS_TIMELEFT=Time left
IDS_SIGN_SIGNED=Signed
IDS_SIGN_UNSIGNED=Not signed
IDS_GROUP_ALLOWED=Sallitut ohjelmat
IDS_GROUP_BLOCKED=Estetyt ohjelmat
IDS_GROUP_ENABLED=Enabled rules
IDS_GROUP_DISABLED=Pois käytöstä olevat säännöt
IDS_DIRECTION_1=Lähtevä
IDS_DIRECTION_2=Saapuva
IDS_DIRECTION_3=Molemmat
IDS_ACTION_ALLOW=Salli
IDS_ACTION_BLOCK=Estä
IDS_ENABLE_CHK=Enable rule
IDS_WIKI=Help
IDS_SAVE=Ota käyttöön
IDS_CLOSE=Sulje
IDS_SETTINGS_GENERAL=General
IDS_TITLE_GENERAL=Yleinen kokoonpano
IDS_TITLE_LANGUAGE=Kieli
IDS_TITLE_CONFIRMATIONS=Vahvistukset
IDS_TITLE_INTERFACE=Interface
IDS_TITLE_HIGHLIGHTING=Korostus
IDS_TITLE_LOGGING=Log to file
IDS_TITLE_NOTIFICATIONS=Ilmoitukset
IDS_TITLE_ADVANCED=Advanced
IDS_ALWAYSONTOP_CHK=Aina päällimmäisenä
IDS_LOADONSTARTUP_CHK=Lataa järjestelmän käynnistyessä
IDS_STARTMINIMIZED_CHK=Start minimized
IDS_SHOWFILENAMESONLY_CHK=Näytä ainoastaan tiedostonimet
IDS_AUTOSIZECOLUMNS_CHK=Automaattinen sarakkeiden koko
IDS_SKIPUACWARNING_CHK=Skippaa "User Account Control" ilmoitus varoitus
IDS_CHECKUPDATES_CHK=Tarkista päivitykset säännöllisesti (suositeltavaa)
IDS_LANGUAGE_HINT=Valitse kieli:
IDS_USESTEALTHMODE_CHK=Salli stealth-tila
IDS_USESTEALTHMODE_HINT=Estä porttien skannaus käyttäen hiljaista sisääntulon TCP RST pudotusta sekä lähtevät ICMP "Kohde tavoittamaton" estääksesi UDP portti skannausta.
IDS_INSTALLBOOTTIMEFILTERS_CHK=Asenna käynnistyksen aikaiset suodattimet
IDS_INSTALLBOOTTIMEFILTERS_HINT=Estä datan vuotaminen järjestelmän käynnistymisen yhteydessä, jopa ennenkuin "Base Filtering Engine" (BFE) palvelu käynnistyy.
IDS_USECERTIFICATES_CHK=Check apps for digital signatures
IDS_USENETWORKRESOLUTION_CHK=Resolve network addresses
IDS_DISABLEWINDOWSFIREWALL_CHK=Poista Windowsin palomuuri käytöstä
IDS_ENABLEWINDOWSFIREWALL_CHK=Ota Windowsin palomuuri käyttöön
IDS_CONFIRMEXIT_CHK=Näytä vahvistus dialoogi suljettaessa
IDS_CONFIRMEXITTIMER_CHK=Show confirmation dialog on exit when timers are active
IDS_CONFIRMLOGCLEAR_CHK=Vahvista kun loki tyhjennetään
IDS_COLORS_HINT=Double-click an item to change it.
IDS_ENABLELOG_CHK=Salli pudotettujen pakettien kirjaaminen tiedostoon
IDS_LOGSHOW=Näytä loki
IDS_LOGCLEAR=Tyhjennä loki
IDS_LOGSIZELIMIT_HINT=Maksimi lokitiedoston koko: (kB)
IDS_ENABLENOTIFICATIONS_CHK=Salli pudotettujen pakettien ilmoitukset
IDS_NOTIFICATIONSOUND_CHK=Enable notifications sound
IDS_NOTIFICATIONTIMEOUT_HINT=Aikakatkaisu samoilla ilmoituksilla (sek.):
IDS_NOTIFY_TOOLTIP=Create a special rule to allow access to address and/or port for this application.
IDS_QUESTION=Oletko varma?
IDS_QUESTION_DELETE=Delete selected item(s)?
IDS_QUESTION_START=Tämä estää valitun kokoonpanon ohjelmien verkkoyhteydet! Haluatko jatkaa?
IDS_QUESTION_STOP=Tämä palauttaa verkkoon pääsyn kaikille estetyille ohjelmille! Oletko varma että haluat jatkaa?
IDS_QUESTION_EXIT=Installed filters will work even if you exit, continue?
IDS_QUESTION_TIMER=Timer activated. Timer are working only when application is running, exit?
IDS_QUESTION_TIMERS=Delete all timer(s)?
IDS_QUESTION_FLAG_CHK=Do not ask again
IDS_STATUS_EMPTY=Empty.
IDS_STATUS_SYNTAX_ERROR=Syntax virhe säännössä!
IDS_ADDRESS_LOCAL=Source
IDS_ADDRESS_REMOTE=Destination
IDS_UPDATE_ERROR=Update server connection error.
IDS_UPDATE_DOWNLOAD=Downloading update...
IDS_UPDATE_DONE=Downloading update finished.
IDS_GROUP_SPECIAL_APPS=Special rules apps
IDS_RULE_ALLOWLOOPBACK_HINT=This allows all loopback traffic.
IDS_RESET=Reset
IDS_EXCLUDESTEALTH_CHK=port scanner connections
IDS_EXCLUDEBLOCKLIST_CHK=blocklist
IDS_UPDATE_INIT=Checking for new releases...
IDS_UPDATE_INSTALL=Update available, do you want to install them?
IDS_EXCLUDECUSTOM_CHK=user rules
IDS_EXCLUDECLASSIFYALLOW_CHK=allowed connections
IDS_STATUS_TIMER_DONE=Timer for application has been expired
IDS_ICONSEXTRALARGE=Extra large
IDS_STATUS_UNUSED_APPS=Unused apps
IDS_STATUS_TIMER_APPS=Timer apps
IDS_SECUREFILTERS_CHK=Enable protection of installed filters
IDS_SECUREFILTERS_HINT=Prevent unauthorized applications from accessing the installed filters.
IDS_USEREFRESHDEVICES_CHK=Refresh filters when devices are connected
IDS_RULE_ALLOW6TO4=Allow IPv6 redirections (6to4) for all
IDS_RECOMMENDED=recommended
IDS_ICONSISTABLEVIEW=Show as table
IDS_ACTION_ALLOW_HINT=Allow network access forever
IDS_ACTION_BLOCK_HINT=Block network access forever ('til kingdom come)
IDS_ACTION_LATER_HINT=Ignore and ask me later
IDS_RULE_APPLY_2=Apply "%s" for app
IDS_EDITRULES=Edit rules
IDS_TAB_APPS=Apps
IDS_TAB_SERVICES=Services
IDS_TAB_PACKAGES=UWP apps
IDS_TAB_NETWORK=Connections
IDS_STATE=State
IDS_STATUS_FILTERS_ACTIVE=Filters are enabled.
IDS_STATUS_FILTERS_INACTIVE=Filters are disabled!
IDS_STATUS_FILTERS_PROCESSING=Applying filters
IDS_HIGHLIGHT_CONNECTION=Have network connections
IDS_SHOWINLIST=Show in list
IDS_BLOCKLIST_SPY=Microsoft spying and telemetry servers
IDS_BLOCKLIST_UPDATE=Microsoft update servers
IDS_BLOCKLIST_EXTRA=Microsoft applications servers
IDS_PORT=Port
IDS_NOTIFY_TITLE=Network alert
IDS_NOTIFY_HEADER=Network connection was blocked
IDS_DISABLE=Disable
IDS_TITLE_SECURITY=Security
IDS_LOGVIEWER_HINT=Log viewer app
IDS_NOTIFICATIONONTRAY_CHK=Show notification window on tray
IDS_NETWORK_CLOSE=Close connection
IDS_RULE_BLOCKOUTBOUND=Block outbound connections for all
IDS_RULE_BLOCKINBOUND=Block inbound connections for all
IDS_VIEW_ICON=Icons
IDS_VIEW_DETAILS=Details
IDS_VIEW_TILE=Tiles
IDS_RULE_HINT=If you leave fields blank, then rule will be applied for any address and port.
IDS_RULE_APPS_HINT=If there is no apps selected, then rule will be applied for all apps.
IDS_STATUS_FILTERS_ACTIVE_TEMP=Filters are enabled until reboot.
IDS_INSTALL_PERMANENT=Permanent rules. Rules are working until you disable it manually.
IDS_INSTALL_TEMPORARY=Temporary rules. Rules are reset after the next reboot.
IDS_ENABLEUILOG_CHK=Enable packets logging interface
IDS_NOTIFICATIONFULLSCREENSILENTMODE_CHK=Enable silent-mode when full screen app in foreground
IDS_TITLE_TRAY=Tray icon
IDS_TRAYICONSINGLECLICK_CHK=Single click on tray icon to open
IDS_ENABLE_APP_CHK=Enable network access
IDS_APP_HINT=There is no reason to set any permissive rule for app with already enabled internet access.
IDS_HOST=Host
IDS_CONFIRMALLOW_CHK=Confirm when allowing application
IDS_QUESTION_ALLOW=Are you sure you want to enable full internet access for this application?
IDS_SHOWSEARCHBAR_CHK=Show search bar
IDS_LAYER=Layer
IDS_RULE_ALLOWWINDOWSUPDATE=Allow Windows Update
IDS_ACTION_TERMINATE_HINT=Terminate process
IDS_PROFILE_TYPE=Profile type
IDS_USEAPPMONITOR_CHK=Monitor apps changing
IDS_DISABLEREMOVAL=Disable removal
IDS_USEHASHES_CHK=Check apps for sha-256 hash
IDS_COMMENT=Comments
IDS_USEDARKTHEME=Use dark theme
IDS_KEEPUNUSED_CHK=Keep unused apps
IDS_UPDATE_NO=Päivityksiä ei ole saatavilla.
IDS_UPDATE_YES=Update available. Download and install now?
IDS_UPDATE_SPEED=Speed
IDS_RULE_FOR_ALL=for all
IDS_RULE_FOR_APPS=for apps
IDS_PROFILE_TYPE_PLAIN=Plain
IDS_PROFILE_TYPE_COMPRESSED=Compressed
IDS_PROFILE_TYPE_ENCRYPTED=Encrypted
IDS_SESSION_ONLY=session only
IDS_LIMIT_REACHED=Limit reached.
IDS_INTERNAL_RULE=Internal rule
IDS_LOADING=Loading...
IDS_DIRECTION_REMOTE=Remote
IDS_DIRECTION_LOCAL=Local
IDS_WARNING_UNEXPECTED=Be careful, through service/driver host (svchost.exe/System) internet traffic can let out through unexpected ways. Continue?
IDS_WARNING_ME=If you disallow main process, you cannot use resolve network addresses option. Continue?
IDS_TOTAL=Total
IDS_EXCLUDEINBOUND_CHK=inbound multicast/broadcast
